---
kind: enumMember
id: F:Autodesk.Revit.DB.ImportExportFileFormat.Civil3D
enum: Autodesk.Revit.DB.ImportExportFileFormat
source: html/f43a36a6-ebce-29e2-693b-9b9867da026b.htm
---
# Autodesk.Revit.DB.ImportExportFileFormat.Civil3D

Civil3D format. Obsolete.